CREATE TABLE info_client (
    id INT primary key,
    date Varchar,
    solution Varchar
);

INSERT INTO info_client VALUES
    (1, '2018-08-01', 'одобрено'),
    (2, '2018-09-02', 'отказ'),
    (3, '2018-08-06', 'отказ'),
    (4, '2018-07-01', 'одобрено'),
    (5, '2018-05-09', 'одобрено'),
    (6, '2018-04-01', 'одобрено'),
    (7, '2018-01-02', 'отказ'),
    (8, '2018-05-10' , 'одобрено');

CREATE TABLE client (
    id INT primary key,
   city VARCHAR,
    info_id INT,
    client_type Varchar
);
INSERT into client VALUES(11, 'Москва', 1,'Основной заёмщик'),
      (22,  'Воронеж', 2, 'Основной заёмщик'),
      (33,  'Волгоград', 3,'Основной заёмщик'),
      (44,  'Москва', 6 ,'Основной заёмщик'),
      (55, 'Нижний Новгород', 5, 'Поручитель'),
      (66, 'Екатеринбург', 7,'Третье лицо'),
      (77, 'Воронеж', 1,'Поручитель'),
      (88, 'Москва', 8 ,'Основной заёмщик'),
      (99, 'Волгоград', 3, 'Залогодатель'),
      (1010, 'Волгоград', 4 ,'Поручитель'),
      (1111, 'Волгоград', 4 ,'Основной заёмщик'),
      (1212, 'Нижний Новгород', 5, 'Основной заёмщик'),
      (1313, 'Екатеринбург', 7, 'Основной заёмщик'),
      (1414, 'Москва', 6, 'Третье лицо');

SELECT info_client.id, info_client.date, client.id AS client_id
FROM info_client LEFT JOIN client ON info_client.id = client.info_id
WHERE info_client.solution = 'одобрено' AND client.city = 'Москва';
